import streamlit as st

def write(text, size=130):
    st.write(f'<p style="text-align:center; font-size:{size}%;">{text}</p>', unsafe_allow_html=True)

st.write('<p style="text-align:center; font-size:400%;">Межполушарная асимметрия мозга</p>', unsafe_allow_html=True)

st.write('<p style="text-align:center; font-size:150%;">Автор проекта: Матанцев Дмитрий</p>', unsafe_allow_html=True)
write("Актуальность")
st.write("В наши дни необходимо изучение функциональной межполушарной асимметрии для оптимизации условий обучения в школе.")
write("Проблема")
st.write("В практической работе педагогов и психологов школьных учреждений в процессе обучения и воспитания довольно редко учитываются данные о функциональной асимметрии мозга ребёнка, по которым можно определить особенности протекания ряда психических процессов.")
write("Гипотеза")
st.write("Если узнать больше информации о межполушарной асимметрии мозга, то можно будет составить правильный учебный план работы и начать развитие некоторых качеств")
write("Цель работы")
st.write("Изучить особенности межполушарной асимметрии мозга.")
write("Задачи")
st.write("1. Выяснить, что такое межполушарная асимметрия мозга, и как определить ведущее полушарие.")
st.write("2. Дать рекомендации по формированию индивидуального стиля учения для учеников с разной степенью выраженности функциональной асимметрии (разными ведущими полушариями")
st.write("3. Выявить ведущее полушарие у меня и найти рекомендованный способ обучения.")
st.write("4. Подготовить комплекс упражнений для развития качеств, которые не так сильно выражаются у людей с определенным типом полушарий и протестировать на себе")
write("Методы")
st.write("1. Анализ научно-популярной литературы\n\
2. Эксперимент\n")
write("Продукт")
st.write("В качестве продукта я выбрал разместить этот проект на сайте, чтобы каждый желающий мог увидеть мои исследования")
write("Практическая значимость")
st.write("Слушатель сможет пользоваться продуктом моего проекта и грамотно составить план работы, чтобы исправить свои недостатки")
write("Содержимое проекта", 200)
write("Теоретическая часть:")
st.write("Межполушарная асимметрия мозга — это особенность организации мозга, при которой левое и правое полушария выполняют различные функции.\
Каждое полушарие обрабатывает информацию специфическим образом. Логическое полушарие (обычно левое) имеет дело с точным счетом, специализируется на аналитическом, логическом мышлении и рациональности. В противоположность этому гештальт-полушарие (обычно правое) обрабатывает информацию цельно, имеет дело с образами, эмоциями активно включено в процессы визуализации и творчества. У некоторых людей логическим полушарием является правое, а образным – левое. Термины «логическое полушарие» и «гештальт-полушарие» более точны, их используют, чтобы различать полушария функционально, а не топографически. Но я буду использовать термины «правое» и «левое» полушарие как наиболее часто встречаемые.\
Активное изучение явления функциональной асимметрии полушарий головного мозга (распределение психических функций между полушариями) началось сравнительно недавно. Основные различия в работе полушарий головного мозга человека впервые обнаружил американский ученый, лауреат Нобелевской премии Р.Сперри, который однажды в лечебных целях рискнул рассечь межполушарные связи у больных эпилепсией и с изумлением обнаружил, что два полушария до этого единого мозга ведут себя, как два совершенно различных мозга и даже не всегда до конца понимают друг друга. Человек, у которого было отключено правое полушарие, а работало левое, сохранял способность к речевому общению, правильно реагировал на слова, цифры и другие условные знаки, но часто оказывался беспомощным, когда требовалось что-то делать с предметами материального мира или их изображениями. Когда работало одно правое полушарие, пациент легко справлялся с такими задачами, хорошо разбирался в произведениях живописи, мелодиях и интонациях речи, ориентировался в пространстве, но терял способность понимать сложные словесные конструкции и ему было сложно связно говорить.\
В осуществлении любого вида сложной психической деятельности принимают участие оба полушария, не дублируя друг друга, а обеспечивая разные (и всегда необходимые) стороны этой деятельности. Среди многочисленных фактов, полученных нейрофизиологией, нейропсихологией, эволюционной биологией, наиболее важными, пожалуй, являются результаты, доказывающие непрерывное взаимодействие полушарий.\
Научные данные о функциональной асимметрии больших полушарий важны для правильной организации обучения людей разного возраста, выбора той или иной профессии.  Нередко говорят о том, что «правополушарным» людям лучше выбирать профессии актёров, журналистов, музыкантов, а «левополушарным» - профессии математиков, инженеров, программистов, юристов. Функциональная асимметрия является одной из важнейших психофизиологических закономерностей в деятельности головного мозга человека. Все проявления функциональной асимметрии делятся на три группы: моторная, сенсорная и психическая асимметрии человека.\
     Под моторной (или двигательной) асимметрией понимается совокупность признаков неравенства функций рук, ног, половин туловища и лица в формировании общего двигательного поведения и его выразительности. Левши и правши отличаются во всем двигательном поведении, психомоторных процессах в целом. У большинства людей правая рука превосходит левую по силе ловкости, скорости реакции, тонкости двигательной координации. Движения ведущей руки управляются, осознаются точнее. При одновременном движении обеих рук больше внимания человека концентрируется на движениях ведущей руки.\
     Под сенсорной асимметрией понимается совокупность признаков функционального неравенства парных органов чувств и разных видов чувствительности на правой и левой половине тела. Асимметрия зрения проявляется в том, что, несмотря на бинокулярное зрение, зрительные впечатления каждого из глаз обладают неодинаковой силой, качеством, четкостью зрительного образа. Ведущий глаз первым останавливается на предмете. Асимметрия слуха проявляется в его остроте, качестве восприятия вербальной и музыкальной информации.\
     Понятие психической асимметрии подразумевает неравенство больших полушарий мозга при осуществлении психической деятельности, которая включает эмоциональные проявления, восприятие, мышление, сознание, речевую и другие функции. Левое полушарие ответственно за двигательные функции, язык и речь, а правое управляет навыками, связанными с чувственным (прежде всего, зрительным) и пространственным опытом. \
С помощью комплексного метода определения ведущего полушария Яссмана Л.В. и Даниленко В.Н., можно определить свое ведущее полушарие. У меня ведущее полушарие - левое\
Вот некоторые рекомендации по формированию стиля обучения для учеников с разными ведущими полушариями:\n\
Для учеников с доминированием левого (логического, вербального) полушария:\
Использовать больше печатных материалов, текстов, схем, таблиц.\
Делать акцент на логические рассуждения, последовательное изложение фактов.\
Применять вербальные методы обучения: лекции, дискуссии, устные инструкции.\
Давать задания на анализ, классификацию, систематизацию информации.\
Использовать четкие структурированные планы уроков.\n\
Для учеников с доминированием правого (образного, креативного) полушария:\
Использовать наглядные материалы: картинки, видео, презентации.\
Применять творческие задания: рисунки, коллажи.\
Задействовать воображение, метафоры, аналогии.\
Использовать цвет, музыку для лучшего запоминания.\
Давать возможность для экспериментирования и нестандартных решений.\
Группировать материал в целостные образы, а не отдельные факты.")
write("Практическая часть:")
st.write("На протяжении 2 месяцев я пробовал на себе комплекс упражнений для развития качеств, которые не так сильно выражаются у людей с ведущим левым полушарием:\
Творческое рисование и лепка из пластилина (это развивает воображение и креативность), выполнял задания на визуализацию образов или сцен по описанию (тренирует образное мышление), пробовал игры на поиск необычных решений и ассоциаций (развивает нестандартный подход), создавал коллажи или рисунки на заданную тему (стимулирует творческое самовыражение), читал тексты с одновременным рисованием иллюстраций, выполнял задания на поиск метафор и аналогий к абстрактным понятиям (тренируют образное и вербальное мышление).\
После этого я могу сказать, что весь этот комплекс упражнений помог мне уменьшить разницу между полушариями, мне стало легче обрабатывать информацию цельно, иметь дело с образами, эмоциями, стало легче визуализировать различные ситуации. ")

write("Заключение")
st.write("Цели и задачи моего исследования выполнены. Я раскрыл вопрос о межполушарной асимметрии мозга, о типах функциональной организации двух полушарий мозга, об особенностях мышления и поведения людей с ярко выраженной межполушарной асимметрией, дал характеристику левополушарных и правополушарных учеников. Я выявил свое ведущее полушарие с помощью комплексного метода определения доминирующего полушария Яссмана Л. В. и Даниленко В. Н. Кроме этого, я дал рекомендации по формированию индивидуального стиля учения для учеников с разной степенью выраженности функциональной асимметрии, подобрал упражнения для развития творческого мышления (правое полушария) и абстрактно-логического мышления (левое полушария).")

st.write("\n"); st.write("\n"); st.write("\n"); st.write("\n")
st.write(f'<p style="text-align:right; font-size:70%;">Данную страницу посетило 37 пользователей</p>', unsafe_allow_html=True)
